9/data/attachments/617fc991b1ac91be.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_058eefb2-d7a6-4289-8e9d-d1b68a887385</nif:username>
            <nif:friendToBeAdded>Carol_everybody_Friend_90254_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>